# Housing Data  Preprocessing

In [342]:
# Reading the housing data
import pandas as pd
data=pd.read_csv('E:\DS_ACADEMIC\DS2\DSTT\Excercise code\housingdata.csv')

****************************************************************************

In [343]:
# Displaying first 6 rows
data.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

****************************************************************************

In [344]:
#Displaying column names
data.columns.tolist()

['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

****************************************************************************

In [345]:
#Displaying column names
data.index.tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8]

****************************************************************************

In [346]:
#Number of 'STATE' exist in the dtaset
data.STATE.shape

(9,)

****************************************************************************

In [347]:
#Unique state exist in the dataset
import numpy as np
list1=pd.unique(data.STATE)
print(list1)
print(len(list1))

['MP' 'MAHARASHTRA' 'AP' 'TN' 'ASSAM' 'HP']
6

****************************************************************************

In [348]:
#List of all NaN
data.isna

<bound method DataFrame.isna of            PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800>

****************************************************************************

In [349]:
#Drop all rows with values is Num_Bedroom
data=data.dropna(subset=['NUM_BEDROOMS'])
data=data[(data.NUM_BEDROOMS != 'na')]
print(data)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

****************************************************************************

In [350]:
#Replace the NaN and string entries in 'NUM_BATH' with previous entries.
data['NUM_BATH']=data.NUM_BATH.fillna(method='ffill')
data['NUM_BATH']=data.NUM_BATH.replace('HURLEY',2)
print(data)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      1.5   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2        2   950
7  100008000.0           HP      23131            1        1   NaN

****************************************************************************

In [351]:
# Replace the empty values in 'SQ_FT' with the mean of all entries
data['SQ_FT']=data.SQ_FT.replace('--',np.NaN)
data['SQ_FT']=data.SQ_FT.astype(float)
data['SQ_FT']=data.SQ_FT.replace(np.NaN,data.SQ_FT.mean())
print(data)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1062.5
3  100004000.0           TN     321321            1      1.5   700.0
4          NaN           TN  589465645            3        2  1600.0
6  100007000.0        ASSAM    3222321            2        2   950.0
7  100008000.0           HP      23131            1        1  1062.5

****************************************************************************

In [352]:
# Sum of SQ_FT of all entries in the dataset
sum=data.SQ_FT.sum()
print(sum)

6375.0

****************************************************************************

In [353]:
# Add a new column "NUM_STORE" and with all the values as 1 for all rows
data['NUM_STORE']=1
data

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
6,100007000.0,ASSAM,3222321,2,2,950.0,1
7,100008000.0,HP,23131,1,1,1062.5,1

****************************************************************************

In [361]:
# Create a DataFrame ontainning all entries of TN state only
df1=pd.DataFrame(data[data['STATE']=='TN'])
print(df1)

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1      1.5   700.0          1
4          NaN    TN  589465645            3        2  1600.0          1

*****************************************************************************

In [364]:
# Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame
df2=pd.DataFrame(data[data['SQ_FT']>1000])
print(df2)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  \
1  100002000.0  MAHARASHTRA      21325            3      1.5  1062.5
4          NaN           TN  589465645            3        2  1600.0
7  100008000.0           HP      23131            1        1  1062.5

   NUM_STORE
1          1
4          1
7          1

*******************************END********************************************